Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/women_s_health/fertility_treatment.html.txt.tmx
Source language: en
Languages: ga

source: Assisted human reproduction services (including In Vitro Fertilisation or IVF) are not provided by the public health services
ga: Ní chuireann na seirbhísí sláinte poiblí seirbhísí Atáirgthe Dhaonna Chuidithe (lena n áirítear Toirchiú In Vitro nó IVF) ar fáil

source: Any services that are provided are not currently subject to statutory control
ga: Níl na seirbhísí a chuirtear ar fáil faoi réir ag rialú reachtach i láthair na huaire

source: Laws in relation to the area have been passed but are not yet in force
ga: Táthar tar éis dlíthe i ndáil leis an limistéar a rith, ach níor tháinig siad i bhfeidhm go fóill

source: Medical practice concerning the provision of assisted human reproduction services is governed by guidelines issued by the Irish Medical Council
ga: Tá an cleachtas míochaine maidir le Seirbhísí Atáirgthe Dhaonna Chuidithe á rialú ag treoirlínte eisithe ag Comhairle na nDochtúirí Leighis

source: In Vitro Fertilisation (IVF) is available from private consultants and clinics
ga: Tá Toirchiú In Vitro (IVF) ar fáil (go pointe áirithe) ó lianna comhairleacha príobháideacha agus i gclinicí príobháideacha

source: IVF is not provided by the public health services
ga: Níl an toirchiú in vitro ar fáil ó na seirbhísí sláinte poiblí agus níl fáil forleathan ar an tseirbhís in Éirinn

source: Your family doctor (GP) may refer you to the private specialists and clinics that provide the service or you may be able to contact the clinic directly for an appointment
ga: Féadfaidh do lia teaghlaigh (GP) tú a atreorú chuig na speisialtóirí agus clinicí príobháideacha a sholáthraíonn an tseirbhís nó b’fhéidir go mbeifeá in ann teagmháil a dhéanamh leis an gclinic go díreach i gcomhair coinne

source: The Commission on Assisted Human Reproduction completed its report on how assisted human reproduction might be regulated in April 2005
ga: Is ar bhunús na moltaí seo a chuirfear daoine ar an eolas sa díospóireacht phoiblí sula nglacfar le moltaí maidir le polasaí

source: View the Report of the Commission on Assisted Human Reproduction here (pdf)
ga: Tá an tuarascáil an Choimisiúin ar fáil anseo (pdf)

source: The Children and Family Relationships Act 2015 includes laws on assisted human reproduction but these have not yet come into force
ga: Áirítear leis an Acht um Leanaí agus Cóngais Teaghlaigh 2015 dlíthe faoin atáirgeadh daonna cuidithe, ach níor tháinig siad i bhfeidhm go fóill

source: You can read more about the Act in our publication Relate (pdf)
ga: Is féidir leat a thuilleadh a léamh faoin Acht inár bhfoilseachán Relate (pdf)

source: The Medical Council has ethical guidelines (pdf) that include a section on assisted human reproduction and set out the conditions under which it is ethical for a doctor to provide IVF treatment
ga: I mBealtaine 2005, chuir an tAire Sláinte an Tuarascáil faoi bhráid Chomhchoiste um Shláinte agus Leanaí an Oireachtais le breithniú. Beidh a mholtaí mar bhonn chun eolas a thabhairt don díospóireacht phoiblí sula gcuirfear moladh beartais ar bith i gcrích

source: Tax relief and fertility treatment
ga: Faoiseamh cánach agus cóireáil toirchithe

source: You may claim tax relief on the costs involved in IVF treatment as part of the tax relief for medical expenses scheme
ga: Féadfaidh tú faoiseamh cánach a éileamh maidir leis na costais a bhaineann le cóireáil toirchithe in vitro mar chuid den scéim um fhaoiseamh cánach i leith costais leighis

source: Drugs used as part of fertility treatment are also covered under the Drugs Payment Scheme
ga: Áirítear na drugaí a úsáidtear mar chuid de chóireáil torthúlachta mar drugaí atá clúdaithe ag anScéim um Íocaíochtaí Drugaí

source: Under the Drugs Payment Scheme there is a limit to how much you have to pay for approved prescribed drugs, medicines and appliances in a given month
ga: Bíonn teorainn faoin Scéim Íocaíochta Drugaí leis an méid a chaitheann tú a íoc as drugaí ceadaithe ar oideas, as cógais leighis agus as fearais áirithe in aon mhí amháin
